package main

import (
	"fmt"
)

// Дана последовательность температурных колебаний: -25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
//Объединить данные значения в группы с шагом в 10 градусов.
//Последовательность в подмножноствах не важна.
//
//Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.

func main() {
	mp := make(map[int][]float64)
	arr := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}
	for _, el := range arr {
		buf := int(el/10) * 10
		if _, ok := mp[buf]; ok {
			mp[buf] = append(mp[buf], el)
		} else {
			mp[buf] = make([]float64, 0)
			mp[buf] = append(mp[buf], el)
		}
	}
	fmt.Println(mp)
}
